Revit 2026 API

# GradientBackgroundSettingsSkyColor Property

---

The color of the top of the sky.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color SkyColor { get; set; }
```
```vb
Public Property SkyColor As Color
	Get
	Set
```
```cpp
public:
property Color^ SkyColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member SkyColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

GradientBackgroundSettings Class

Autodesk.Revit.DB Namespace